Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/sec_eng_reg.h
/* 0x204 : se_trng_0_status */
#define SEC_ENG_SE_TRNG_0_STATUS_OFFSET (0x204)
#define SEC_ENG_SE_TRNG_0_STATUS        SEC_ENG_SE_TRNG_0_STATUS
#define SEC_ENG_SE_TRNG_0_STATUS_POS    (0U)
#define SEC_ENG_SE_TRNG_0_STATUS_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_STATUS_MSK    (((1U << SEC_ENG_SE_TRNG_0_STATUS_LEN) - 1) << SEC_ENG_SE_TRNG_0_STATUS_POS)
#define SEC_ENG_SE_TRNG_0_STATUS_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_STATUS_LEN) - 1) << SEC_ENG_SE_TRNG_0_STATUS_POS))

/* 0x208 : se_trng_0_dout_0 */
#define SEC_ENG_SE_TRNG_0_DOUT_0_OFFSET (0x208)
#define SEC_ENG_SE_TRNG_0_DOUT_0        SEC_ENG_SE_TRNG_0_DOUT_0
#define SEC_ENG_SE_TRNG_0_DOUT_0_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_0_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_0_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_0_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_0_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_0_POS))

/* 0x20C : se_trng_0_dout_1 */
#define SEC_ENG_SE_TRNG_0_DOUT_1_OFFSET (0x20C)
#define SEC_ENG_SE_TRNG_0_DOUT_1        SEC_ENG_SE_TRNG_0_DOUT_1
#define SEC_ENG_SE_TRNG_0_DOUT_1_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_1_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_1_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_1_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_1_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_1_POS))

/* 0x210 : se_trng_0_dout_2 */
#define SEC_ENG_SE_TRNG_0_DOUT_2_OFFSET (0x210)
#define SEC_ENG_SE_TRNG_0_DOUT_2        SEC_ENG_SE_TRNG_0_DOUT_2
#define SEC_ENG_SE_TRNG_0_DOUT_2_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_2_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_2_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_2_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_2_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_2_POS))

/* 0x214 : se_trng_0_dout_3 */
#define SEC_ENG_SE_TRNG_0_DOUT_3_OFFSET (0x214)
#define SEC_ENG_SE_TRNG_0_DOUT_3        SEC_ENG_SE_TRNG_0_DOUT_3
#define SEC_ENG_SE_TRNG_0_DOUT_3_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_3_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_3_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_3_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_3_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_3_POS))

/* 0x218 : se_trng_0_dout_4 */
#define SEC_ENG_SE_TRNG_0_DOUT_4_OFFSET (0x218)
#define SEC_ENG_SE_TRNG_0_DOUT_4        SEC_ENG_SE_TRNG_0_DOUT_4
#define SEC_ENG_SE_TRNG_0_DOUT_4_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_4_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_4_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_4_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_4_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_4_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_4_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_4_POS))

/* 0x21C : se_trng_0_dout_5 */
#define SEC_ENG_SE_TRNG_0_DOUT_5_OFFSET (0x21C)
#define SEC_ENG_SE_TRNG_0_DOUT_5        SEC_ENG_SE_TRNG_0_DOUT_5
#define SEC_ENG_SE_TRNG_0_DOUT_5_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_5_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_5_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_5_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_5_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_5_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_5_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_5_POS))

/* 0x220 : se_trng_0_dout_6 */
#define SEC_ENG_SE_TRNG_0_DOUT_6_OFFSET (0x220)
#define SEC_ENG_SE_TRNG_0_DOUT_6        SEC_ENG_SE_TRNG_0_DOUT_6
#define SEC_ENG_SE_TRNG_0_DOUT_6_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_6_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_6_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_6_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_6_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_6_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_6_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_6_POS))

/* 0x224 : se_trng_0_dout_7 */
#define SEC_ENG_SE_TRNG_0_DOUT_7_OFFSET (0x224)
#define SEC_ENG_SE_TRNG_0_DOUT_7        SEC_ENG_SE_TRNG_0_DOUT_7
#define SEC_ENG_SE_TRNG_0_DOUT_7_POS    (0U)
#define SEC_ENG_SE_TRNG_0_DOUT_7_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_DOUT_7_MSK    (((1U << SEC_ENG_SE_TRNG_0_DOUT_7_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_7_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_7_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_7_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_7_POS))

/* 0x228 : se_trng_0_test */
#define SEC_ENG_SE_TRNG_0_TEST_OFFSET     (0x228)
#define SEC_ENG_SE_TRNG_0_TEST_EN         SEC_ENG_SE_TRNG_0_TEST_EN
#define SEC_ENG_SE_TRNG_0_TEST_EN_POS     (0U)
#define SEC_ENG_SE_TRNG_0_TEST_EN_LEN     (1U)
#define SEC_ENG_SE_TRNG_0_TEST_EN_MSK     (((1U << SEC_ENG_SE_TRNG_0_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_EN_POS)
#define SEC_ENG_SE_TRNG_0_TEST_EN_UMSK    (~(((1U << SEC_ENG_SE_TRNG_0_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_EN_POS))
#define SEC_ENG_SE_TRNG_0_CP_TEST_EN      SEC_ENG_SE_TRNG_0_CP_TEST_EN
#define SEC_ENG_SE_TRNG_0_CP_TEST_EN_POS  (1U)
#define SEC_ENG_SE_TRNG_0_CP_TEST_EN_LEN  (1U)
#define SEC_ENG_SE_TRNG_0_CP_TEST_EN_MSK  (((1U << SEC_ENG_SE_TRNG_0_CP_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_TEST_EN_POS)
#define SEC_ENG_SE_TRNG_0_CP_TEST_EN_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_CP_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_TEST_EN_POS))
#define SEC_ENG_SE_TRNG_0_CP_BYPASS       SEC_ENG_SE_TRNG_0_CP_BYPASS
#define SEC_ENG_SE_TRNG_0_CP_BYPASS_POS   (2U)
#define SEC_ENG_SE_TRNG_0_CP_BYPASS_LEN   (1U)
#define SEC_ENG_SE_TRNG_0_CP_BYPASS_MSK   (((1U << SEC_ENG_SE_TRNG_0_CP_BYPASS_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_BYPASS_POS)
#define SEC_ENG_SE_TRNG_0_CP_BYPASS_UMSK  (~(((1U << SEC_ENG_SE_TRNG_0_CP_BYPASS_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_BYPASS_POS))
#define SEC_ENG_SE_TRNG_0_HT_DIS          SEC_ENG_SE_TRNG_0_HT_DIS
#define SEC_ENG_SE_TRNG_0_HT_DIS_POS      (3U)
#define SEC_ENG_SE_TRNG_0_HT_DIS_LEN      (1U)
#define SEC_ENG_SE_TRNG_0_HT_DIS_MSK      (((1U << SEC_ENG_SE_TRNG_0_HT_DIS_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_DIS_POS)
#define SEC_ENG_SE_TRNG_0_HT_DIS_UMSK     (~(((1U << SEC_ENG_SE_TRNG_0_HT_DIS_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_DIS_POS))
#define SEC_ENG_SE_TRNG_0_HT_ALARM_N      SEC_ENG_SE_TRNG_0_HT_ALARM_N
#define SEC_ENG_SE_TRNG_0_HT_ALARM_N_POS  (4U)
#define SEC_ENG_SE_TRNG_0_HT_ALARM_N_LEN  (8U)
#define SEC_ENG_SE_TRNG_0_HT_ALARM_N_MSK  (((1U << SEC_ENG_SE_TRNG_0_HT_ALARM_N_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_ALARM_N_POS)
#define SEC_ENG_SE_TRNG_0_HT_ALARM_N_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_HT_ALARM_N_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_ALARM_N_POS))

/* 0x22C : se_trng_0_ctrl_1 */
#define SEC_ENG_SE_TRNG_0_CTRL_1_OFFSET     (0x22C)
#define SEC_ENG_SE_TRNG_0_RESEED_N_LSB      SEC_ENG_SE_TRNG_0_RESEED_N_LSB
#define SEC_ENG_SE_TRNG_0_RESEED_N_LSB_POS  (0U)
#define SEC_ENG_SE_TRNG_0_RESEED_N_LSB_LEN  (32U)
#define SEC_ENG_SE_TRNG_0_RESEED_N_LSB_MSK  (((1U << SEC_ENG_SE_TRNG_0_RESEED_N_LSB_LEN) - 1) << SEC_ENG_SE_TRNG_0_RESEED_N_LSB_POS)
#define SEC_ENG_SE_TRNG_0_RESEED_N_LSB_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_RESEED_N_LSB_LEN) - 1) << SEC_ENG_SE_TRNG_0_RESEED_N_LSB_POS))

/* 0x230 : se_trng_0_ctrl_2 */
#define SEC_ENG_SE_TRNG_0_CTRL_2_OFFSET     (0x230)
#define SEC_ENG_SE_TRNG_0_RESEED_N_MSB      SEC_ENG_SE_TRNG_0_RESEED_N_MSB
#define SEC_ENG_SE_TRNG_0_RESEED_N_MSB_POS  (0U)
#define SEC_ENG_SE_TRNG_0_RESEED_N_MSB_LEN  (16U)
#define SEC_ENG_SE_TRNG_0_RESEED_N_MSB_MSK  (((1U << SEC_ENG_SE_TRNG_0_RESEED_N_MSB_LEN) - 1) << SEC_ENG_SE_TRNG_0_RESEED_N_MSB_POS)
#define SEC_ENG_SE_TRNG_0_RESEED_N_MSB_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_RESEED_N_MSB_LEN) - 1) << SEC_ENG_SE_TRNG_0_RESEED_N_MSB_POS))

