Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/sec_eng_reg.h
/* 0x8 : se_aes_mda */
#define SEC_ENG_SE_AES_MDA_OFFSET (0x8)
#define SEC_ENG_SE_AES_MDA        SEC_ENG_SE_AES_MDA
#define SEC_ENG_SE_AES_MDA_POS    (0U)
#define SEC_ENG_SE_AES_MDA_LEN    (32U)
#define SEC_ENG_SE_AES_MDA_MSK    (((1U << SEC_ENG_SE_AES_MDA_LEN) - 1) << SEC_ENG_SE_AES_MDA_POS)
#define SEC_ENG_SE_AES_MDA_UMSK   (~(((1U << SEC_ENG_SE_AES_MDA_LEN) - 1) << SEC_ENG_SE_AES_MDA_POS))

/* 0xc : se_aes_status */
#define SEC_ENG_SE_AES_STATUS_OFFSET (0xc)
#define SEC_ENG_SE_AES_STATUS        SEC_ENG_SE_AES_STATUS
#define SEC_ENG_SE_AES_STATUS_POS    (0U)
#define SEC_ENG_SE_AES_STATUS_LEN    (32U)
#define SEC_ENG_SE_AES_STATUS_MSK    (((1U << SEC_ENG_SE_AES_STATUS_LEN) - 1) << SEC_ENG_SE_AES_STATUS_POS)
#define SEC_ENG_SE_AES_STATUS_UMSK   (~(((1U << SEC_ENG_SE_AES_STATUS_LEN) - 1) << SEC_ENG_SE_AES_STATUS_POS))

/* 0x10 : se_aes_iv_0 */
#define SEC_ENG_SE_AES_IV_0_OFFSET (0x10)
#define SEC_ENG_SE_AES_IV_0        SEC_ENG_SE_AES_IV_0
#define SEC_ENG_SE_AES_IV_0_POS    (0U)
#define SEC_ENG_SE_AES_IV_0_LEN    (32U)
#define SEC_ENG_SE_AES_IV_0_MSK    (((1U << SEC_ENG_SE_AES_IV_0_LEN) - 1) << SEC_ENG_SE_AES_IV_0_POS)
#define SEC_ENG_SE_AES_IV_0_UMSK   (~(((1U << SEC_ENG_SE_AES_IV_0_LEN) - 1) << SEC_ENG_SE_AES_IV_0_POS))

/* 0x14 : se_aes_iv_1 */
#define SEC_ENG_SE_AES_IV_1_OFFSET (0x14)
#define SEC_ENG_SE_AES_IV_1        SEC_ENG_SE_AES_IV_1
#define SEC_ENG_SE_AES_IV_1_POS    (0U)
#define SEC_ENG_SE_AES_IV_1_LEN    (32U)
#define SEC_ENG_SE_AES_IV_1_MSK    (((1U << SEC_ENG_SE_AES_IV_1_LEN) - 1) << SEC_ENG_SE_AES_IV_1_POS)
#define SEC_ENG_SE_AES_IV_1_UMSK   (~(((1U << SEC_ENG_SE_AES_IV_1_LEN) - 1) << SEC_ENG_SE_AES_IV_1_POS))

/* 0x18 : se_aes_iv_2 */
#define SEC_ENG_SE_AES_IV_2_OFFSET (0x18)
#define SEC_ENG_SE_AES_IV_2        SEC_ENG_SE_AES_IV_2
#define SEC_ENG_SE_AES_IV_2_POS    (0U)
#define SEC_ENG_SE_AES_IV_2_LEN    (32U)
#define SEC_ENG_SE_AES_IV_2_MSK    (((1U << SEC_ENG_SE_AES_IV_2_LEN) - 1) << SEC_ENG_SE_AES_IV_2_POS)
#define SEC_ENG_SE_AES_IV_2_UMSK   (~(((1U << SEC_ENG_SE_AES_IV_2_LEN) - 1) << SEC_ENG_SE_AES_IV_2_POS))

/* 0x1c : se_aes_iv_3 */
#define SEC_ENG_SE_AES_IV_3_OFFSET (0x1c)
#define SEC_ENG_SE_AES_IV_3        SEC_ENG_SE_AES_IV_3
#define SEC_ENG_SE_AES_IV_3_POS    (0U)
#define SEC_ENG_SE_AES_IV_3_LEN    (32U)
#define SEC_ENG_SE_AES_IV_3_MSK    (((1U << SEC_ENG_SE_AES_IV_3_LEN) - 1) << SEC_ENG_SE_AES_IV_3_POS)
#define SEC_ENG_SE_AES_IV_3_UMSK   (~(((1U << SEC_ENG_SE_AES_IV_3_LEN) - 1) << SEC_ENG_SE_AES_IV_3_POS))

/* 0x20 : se_aes_key_0 */
#define SEC_ENG_SE_AES_KEY_0_OFFSET (0x20)
#define SEC_ENG_SE_AES_KEY_0        SEC_ENG_SE_AES_KEY_0
#define SEC_ENG_SE_AES_KEY_0_POS    (0U)
#define SEC_ENG_SE_AES_KEY_0_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_0_MSK    (((1U << SEC_ENG_SE_AES_KEY_0_LEN) - 1) << SEC_ENG_SE_AES_KEY_0_POS)
#define SEC_ENG_SE_AES_KEY_0_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_0_LEN) - 1) << SEC_ENG_SE_AES_KEY_0_POS))

/* 0x24 : se_aes_key_1 */
#define SEC_ENG_SE_AES_KEY_1_OFFSET (0x24)
#define SEC_ENG_SE_AES_KEY_1        SEC_ENG_SE_AES_KEY_1
#define SEC_ENG_SE_AES_KEY_1_POS    (0U)
#define SEC_ENG_SE_AES_KEY_1_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_1_MSK    (((1U << SEC_ENG_SE_AES_KEY_1_LEN) - 1) << SEC_ENG_SE_AES_KEY_1_POS)
#define SEC_ENG_SE_AES_KEY_1_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_1_LEN) - 1) << SEC_ENG_SE_AES_KEY_1_POS))

/* 0x28 : se_aes_key_2 */
#define SEC_ENG_SE_AES_KEY_2_OFFSET (0x28)
#define SEC_ENG_SE_AES_KEY_2        SEC_ENG_SE_AES_KEY_2
#define SEC_ENG_SE_AES_KEY_2_POS    (0U)
#define SEC_ENG_SE_AES_KEY_2_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_2_MSK    (((1U << SEC_ENG_SE_AES_KEY_2_LEN) - 1) << SEC_ENG_SE_AES_KEY_2_POS)
#define SEC_ENG_SE_AES_KEY_2_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_2_LEN) - 1) << SEC_ENG_SE_AES_KEY_2_POS))

/* 0x2c : se_aes_key_3 */
#define SEC_ENG_SE_AES_KEY_3_OFFSET (0x2c)
#define SEC_ENG_SE_AES_KEY_3        SEC_ENG_SE_AES_KEY_3
#define SEC_ENG_SE_AES_KEY_3_POS    (0U)
#define SEC_ENG_SE_AES_KEY_3_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_3_MSK    (((1U << SEC_ENG_SE_AES_KEY_3_LEN) - 1) << SEC_ENG_SE_AES_KEY_3_POS)
#define SEC_ENG_SE_AES_KEY_3_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_3_LEN) - 1) << SEC_ENG_SE_AES_KEY_3_POS))

/* 0x30 : se_aes_key_4 */
#define SEC_ENG_SE_AES_KEY_4_OFFSET (0x30)
#define SEC_ENG_SE_AES_KEY_4        SEC_ENG_SE_AES_KEY_4
#define SEC_ENG_SE_AES_KEY_4_POS    (0U)
#define SEC_ENG_SE_AES_KEY_4_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_4_MSK    (((1U << SEC_ENG_SE_AES_KEY_4_LEN) - 1) << SEC_ENG_SE_AES_KEY_4_POS)
#define SEC_ENG_SE_AES_KEY_4_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_4_LEN) - 1) << SEC_ENG_SE_AES_KEY_4_POS))

/* 0x34 : se_aes_key_5 */
#define SEC_ENG_SE_AES_KEY_5_OFFSET (0x34)
#define SEC_ENG_SE_AES_KEY_5        SEC_ENG_SE_AES_KEY_5
#define SEC_ENG_SE_AES_KEY_5_POS    (0U)
#define SEC_ENG_SE_AES_KEY_5_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_5_MSK    (((1U << SEC_ENG_SE_AES_KEY_5_LEN) - 1) << SEC_ENG_SE_AES_KEY_5_POS)
#define SEC_ENG_SE_AES_KEY_5_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_5_LEN) - 1) << SEC_ENG_SE_AES_KEY_5_POS))

/* 0x38 : se_aes_key_6 */
#define SEC_ENG_SE_AES_KEY_6_OFFSET (0x38)
#define SEC_ENG_SE_AES_KEY_6        SEC_ENG_SE_AES_KEY_6
#define SEC_ENG_SE_AES_KEY_6_POS    (0U)
#define SEC_ENG_SE_AES_KEY_6_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_6_MSK    (((1U << SEC_ENG_SE_AES_KEY_6_LEN) - 1) << SEC_ENG_SE_AES_KEY_6_POS)
#define SEC_ENG_SE_AES_KEY_6_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_6_LEN) - 1) << SEC_ENG_SE_AES_KEY_6_POS))

/* 0x3c : se_aes_key_7 */
#define SEC_ENG_SE_AES_KEY_7_OFFSET (0x3c)
#define SEC_ENG_SE_AES_KEY_7        SEC_ENG_SE_AES_KEY_7
#define SEC_ENG_SE_AES_KEY_7_POS    (0U)
#define SEC_ENG_SE_AES_KEY_7_LEN    (32U)
#define SEC_ENG_SE_AES_KEY_7_MSK    (((1U << SEC_ENG_SE_AES_KEY_7_LEN) - 1) << SEC_ENG_SE_AES_KEY_7_POS)
#define SEC_ENG_SE_AES_KEY_7_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_7_LEN) - 1) << SEC_ENG_SE_AES_KEY_7_POS))

/* 0x40 : se_aes_key_sel_0 */
#define SEC_ENG_SE_AES_KEY_SEL_0_OFFSET (0x40)
#define SEC_ENG_SE_AES_KEY_SEL_0        SEC_ENG_SE_AES_KEY_SEL_0
#define SEC_ENG_SE_AES_KEY_SEL_0_POS    (0U)
#define SEC_ENG_SE_AES_KEY_SEL_0_LEN    (2U)
#define SEC_ENG_SE_AES_KEY_SEL_0_MSK    (((1U << SEC_ENG_SE_AES_KEY_SEL_0_LEN) - 1) << SEC_ENG_SE_AES_KEY_SEL_0_POS)
#define SEC_ENG_SE_AES_KEY_SEL_0_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_SEL_0_LEN) - 1) << SEC_ENG_SE_AES_KEY_SEL_0_POS))

/* 0x44 : se_aes_key_sel_1 */
#define SEC_ENG_SE_AES_KEY_SEL_1_OFFSET (0x44)
#define SEC_ENG_SE_AES_KEY_SEL_1        SEC_ENG_SE_AES_KEY_SEL_1
#define SEC_ENG_SE_AES_KEY_SEL_1_POS    (0U)
#define SEC_ENG_SE_AES_KEY_SEL_1_LEN    (2U)
#define SEC_ENG_SE_AES_KEY_SEL_1_MSK    (((1U << SEC_ENG_SE_AES_KEY_SEL_1_LEN) - 1) << SEC_ENG_SE_AES_KEY_SEL_1_POS)
#define SEC_ENG_SE_AES_KEY_SEL_1_UMSK   (~(((1U << SEC_ENG_SE_AES_KEY_SEL_1_LEN) - 1) << SEC_ENG_SE_AES_KEY_SEL_1_POS))

