Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/sec_eng_reg.h
/* 0x40 : se_trng_test_out_0 */
#define SEC_ENG_SE_TRNG_TEST_OUT_0_OFFSET (0x40)
#define SEC_ENG_SE_TRNG_TEST_OUT_0        SEC_ENG_SE_TRNG_TEST_OUT_0
#define SEC_ENG_SE_TRNG_TEST_OUT_0_POS    (0U)
#define SEC_ENG_SE_TRNG_TEST_OUT_0_LEN    (32U)
#define SEC_ENG_SE_TRNG_TEST_OUT_0_MSK    (((1U << SEC_ENG_SE_TRNG_TEST_OUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_0_POS)
#define SEC_ENG_SE_TRNG_TEST_OUT_0_UMSK   (~(((1U << SEC_ENG_SE_TRNG_TEST_OUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_0_POS))

/* 0x44 : se_trng_test_out_1 */
#define SEC_ENG_SE_TRNG_TEST_OUT_1_OFFSET (0x44)
#define SEC_ENG_SE_TRNG_TEST_OUT_1        SEC_ENG_SE_TRNG_TEST_OUT_1
#define SEC_ENG_SE_TRNG_TEST_OUT_1_POS    (0U)
#define SEC_ENG_SE_TRNG_TEST_OUT_1_LEN    (32U)
#define SEC_ENG_SE_TRNG_TEST_OUT_1_MSK    (((1U << SEC_ENG_SE_TRNG_TEST_OUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_1_POS)
#define SEC_ENG_SE_TRNG_TEST_OUT_1_UMSK   (~(((1U << SEC_ENG_SE_TRNG_TEST_OUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_1_POS))

/* 0x48 : se_trng_test_out_2 */
#define SEC_ENG_SE_TRNG_TEST_OUT_2_OFFSET (0x48)
#define SEC_ENG_SE_TRNG_TEST_OUT_2        SEC_ENG_SE_TRNG_TEST_OUT_2
#define SEC_ENG_SE_TRNG_TEST_OUT_2_POS    (0U)
#define SEC_ENG_SE_TRNG_TEST_OUT_2_LEN    (32U)
#define SEC_ENG_SE_TRNG_TEST_OUT_2_MSK    (((1U << SEC_ENG_SE_TRNG_TEST_OUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_2_POS)
#define SEC_ENG_SE_TRNG_TEST_OUT_2_UMSK   (~(((1U << SEC_ENG_SE_TRNG_TEST_OUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_2_POS))

/* 0x4c : se_trng_test_out_3 */
#define SEC_ENG_SE_TRNG_TEST_OUT_3_OFFSET (0x4c)
#define SEC_ENG_SE_TRNG_TEST_OUT_3        SEC_ENG_SE_TRNG_TEST_OUT_3
#define SEC_ENG_SE_TRNG_TEST_OUT_3_POS    (0U)
#define SEC_ENG_SE_TRNG_TEST_OUT_3_LEN    (32U)
#define SEC_ENG_SE_TRNG_TEST_OUT_3_MSK    (((1U << SEC_ENG_SE_TRNG_TEST_OUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_3_POS)
#define SEC_ENG_SE_TRNG_TEST_OUT_3_UMSK   (~(((1U << SEC_ENG_SE_TRNG_TEST_OUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_OUT_3_POS))

/* 0xfc : se_trng_ctrl_prot */
#define SEC_ENG_SE_TRNG_CTRL_PROT_OFFSET (0xfc)
#define SEC_ENG_SE_TRNG_PROT_EN          SEC_ENG_SE_TRNG_PROT_EN
#define SEC_ENG_SE_TRNG_PROT_EN_POS      (0U)
#define SEC_ENG_SE_TRNG_PROT_EN_LEN      (1U)
#define SEC_ENG_SE_TRNG_PROT_EN_MSK      (((1U << SEC_ENG_SE_TRNG_PROT_EN_LEN) - 1) << SEC_ENG_SE_TRNG_PROT_EN_POS)
#define SEC_ENG_SE_TRNG_PROT_EN_UMSK     (~(((1U << SEC_ENG_SE_TRNG_PROT_EN_LEN) - 1) << SEC_ENG_SE_TRNG_PROT_EN_POS))
#define SEC_ENG_SE_TRNG_ID0_EN           SEC_ENG_SE_TRNG_ID0_EN
#define SEC_ENG_SE_TRNG_ID0_EN_POS       (1U)
#define SEC_ENG_SE_TRNG_ID0_EN_LEN       (1U)
#define SEC_ENG_SE_TRNG_ID0_EN_MSK       (((1U << SEC_ENG_SE_TRNG_ID0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_POS)
#define SEC_ENG_SE_TRNG_ID0_EN_UMSK      (~(((1U << SEC_ENG_SE_TRNG_ID0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_POS))
#define SEC_ENG_SE_TRNG_ID1_EN           SEC_ENG_SE_TRNG_ID1_EN
#define SEC_ENG_SE_TRNG_ID1_EN_POS       (2U)
#define SEC_ENG_SE_TRNG_ID1_EN_LEN       (1U)
#define SEC_ENG_SE_TRNG_ID1_EN_MSK       (((1U << SEC_ENG_SE_TRNG_ID1_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_POS)
#define SEC_ENG_SE_TRNG_ID1_EN_UMSK      (~(((1U << SEC_ENG_SE_TRNG_ID1_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_POS))

struct sec_eng_trng_reg {
    /* 0x0 : se_trng_ctrl_0 */
    union {
        struct
        {
            uint32_t se_trng_busy           : 1;  /* [    0],          r,        0x0 */
            uint32_t se_trng_trig_1t        : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_trng_en             : 1;  /* [    2],        r/w,        0x0 */
            uint32_t se_trng_dout_clr_1t    : 1;  /* [    3],        w1p,        0x0 */
            uint32_t se_trng_ht_error       : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_7           : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t se_trng_int            : 1;  /* [    8],          r,        0x0 */
            uint32_t se_trng_int_clr_1t     : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_trng_int_set_1t     : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_trng_int_mask       : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reserved_12            : 1;  /* [   12],       rsvd,        0x0 */
            uint32_t se_trng_manual_fun_sel : 1;  /* [   13],        r/w,        0x0 */
            uint32_t se_trng_manual_reseed  : 1;  /* [   14],        r/w,        0x0 */
            uint32_t se_trng_manual_en      : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_31         : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_ctrl_0;

    /* 0x4 : se_trng_status */
    union {
        struct
        {
            uint32_t se_trng_status : 32; /* [31: 0],          r,   0x100020 */
        } BF;
        uint32_t WORD;
    } se_trng_status;

    /* 0x8 : se_trng_dout_0 */
    union {
        struct
        {
            uint32_t se_trng_dout_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_0;

    /* 0xc : se_trng_dout_1 */
    union {
        struct
        {
            uint32_t se_trng_dout_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_1;

    /* 0x10 : se_trng_dout_2 */
    union {
        struct
        {
            uint32_t se_trng_dout_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_2;

    /* 0x14 : se_trng_dout_3 */
    union {
        struct
        {
            uint32_t se_trng_dout_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_3;

    /* 0x18 : se_trng_dout_4 */
    union {
        struct
        {
            uint32_t se_trng_dout_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_4;

    /* 0x1c : se_trng_dout_5 */
    union {
        struct
        {
            uint32_t se_trng_dout_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_5;

    /* 0x20 : se_trng_dout_6 */
    union {
        struct
        {
            uint32_t se_trng_dout_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_6;

    /* 0x24 : se_trng_dout_7 */
    union {
        struct
        {
            uint32_t se_trng_dout_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_dout_7;

