Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/sec_eng_reg.h
    /* 0x28 : se_trng_test */
    union {
        struct
        {
            uint32_t se_trng_test_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t se_trng_cp_test_en : 1;  /* [    1],        r/w,        0x0 */
            uint32_t se_trng_cp_bypass  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t se_trng_ht_dis     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t se_trng_ht_alarm_n : 8;  /* [11: 4],        r/w,        0x0 */
            uint32_t reserved_12_31     : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_test;

    /* 0x2c : se_trng_ctrl_1 */
    union {
        struct
        {
            uint32_t se_trng_reseed_n_lsb : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } se_trng_ctrl_1;

    /* 0x30 : se_trng_ctrl_2 */
    union {
        struct
        {
            uint32_t se_trng_reseed_n_msb : 16; /* [15: 0],        r/w,       0xff */
            uint32_t reserved_16_31       : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_ctrl_2;

    /* 0x34 : se_trng_ctrl_3 */
    union {
        struct
        {
            uint32_t se_trng_cp_ratio : 8;  /* [ 7: 0],        r/w,        0x3 */
            uint32_t se_trng_ht_rct_c : 8;  /* [15: 8],        r/w,       0x42 */
            uint32_t se_trng_ht_apt_c : 10; /* [25:16],        r/w,      0x37a */
            uint32_t se_trng_ht_od_en : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_30   : 4;  /* [30:27],       rsvd,        0x0 */
            uint32_t se_trng_rosc_dis : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } se_trng_ctrl_3;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[8];

    /* 0x40 : se_trng_test_out_0 */
    union {
        struct
        {
            uint32_t se_trng_test_out_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_test_out_0;

    /* 0x44 : se_trng_test_out_1 */
    union {
        struct
        {
            uint32_t se_trng_test_out_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_test_out_1;

    /* 0x48 : se_trng_test_out_2 */
    union {
        struct
        {
            uint32_t se_trng_test_out_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_test_out_2;

    /* 0x4c : se_trng_test_out_3 */
    union {
        struct
        {
            uint32_t se_trng_test_out_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_test_out_3;

    /* 0x50  reserved */
    uint8_t RESERVED0x50[172];

    /* 0xfc : se_trng_ctrl_prot */
    union {
        struct
        {
            uint32_t se_trng_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_trng_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_trng_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_ctrl_prot;
};

typedef volatile struct sec_eng_trng_reg sec_eng_trng_reg_t;

#define SEC_ENG_TRNG_OFFSET 0x200

#endif /* __SEC_ENG_REG_H__ */
